In [2]:
import pandas as pd

In [3]:
data = [    ["harry", 34], ["jack",23],["manit", 45]
]

In [4]:
data

[['harry', 34], ['jack', 23], ['manit', 45]]

In [5]:
pd.DataFrame(data,columns=["name","marks"])

    name  marks
0  harry     34
1   jack     23
2  manit     45

In [6]:
data = {"a": [4,5,7], "b": [23,34,54]}

In [7]:
data

{'a': [4, 5, 7], 'b': [23, 34, 54]}

In [8]:
pd.DataFrame(data)

   a   b
0  4  23
1  5  34
2  7  54

In [9]:
import numpy as np

In [10]:
arr = np.array([[1,23,3],[23,4,4]])

In [11]:
df = pd.DataFrame(arr, columns=["a","b","c"])

In [12]:
df

    a   b  c
0   1  23  3
1  23   4  4

In [15]:
fg = pd.read_excel("dumb.xlsx")

In [16]:
fg

      Name    School  Marks
0  Shubham       wer     34
1   joshua        sd    454
2     jack       fre     65
3     alex      flex     43
4  jasmine      mdsc     34
5  shubham     pgdav     32
6    rishi  maharaja     34
7   aakash       abc     34

In [17]:
cs = pd.read_csv("data.csv")
cs

      Name    School  Marks
0  Shubham       wer     34
1   joshua        sd    454
2     jack       fre     65
3     alex      flex     43
4  jasmine      mdsc     34
5  shubham     pgdav     32
6    rishi  maharaja     34
7   aakash       abc     34

In [19]:
df = pd.read_json("data.json")
df

    Name    lang
0  Harry  Python
1   jack  Python

In [22]:
data = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv')
data

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [24]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [25]:
data.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [27]:
data.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [29]:
data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [30]:
data.shape

(244, 7)